-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 19, 2024 at 06:01 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `bmi_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `bmi_records`
--

CREATE TABLE `bmi_records` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `height` float NOT NULL,
  `weight` float NOT NULL,
  `bmi` float NOT NULL,
  `category` varchar(50) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `bmi_records`
--

INSERT INTO `bmi_records` (`id`, `name`, `height`, `weight`, `bmi`, `category`, `created_at`) VALUES
(1, 'Tee', 175, 60, 19.5918, 'Normal weight', '2024-06-17 12:56:35'),
(2, 'Than', 173, 54, 18.0427, 'Underweight', '2024-06-17 12:59:17'),
(3, 'Than', 173, 54, 18.0427, 'Underweight', '2024-06-17 13:06:24'),
(4, '่jack', 160, 80, 31.25, 'Obesity', '2024-06-17 13:06:58'),
(5, '่jack', 160, 80, 31.25, 'อ้วนระดับ 2', '2024-06-17 13:13:50'),
(6, '่jack', 160, 80, 31.25, 'อ้วนระดับ 2', '2024-06-17 13:16:42'),
(7, '่jack', 160, 80, 31.25, 'อ้วนระดับ 2', '2024-06-17 13:17:11'),
(8, '่jack', 160, 80, 31.25, 'อ้วนระดับ 2', '2024-06-17 13:17:47'),
(9, 'Supuksorn', 168, 55, 19.487, 'ปกติสมส่วน', '2024-06-17 13:18:38'),
(10, 'Supuksorn', 168, 55, 19.487, 'Normal weight', '2024-06-17 13:36:28'),
(11, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:36:38'),
(12, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:39:44'),
(13, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:40:57'),
(14, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:41:59'),
(15, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:43:10'),
(16, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:43:32'),
(17, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:44:17'),
(18, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:44:41'),
(19, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:44:56'),
(20, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:45:24'),
(21, 'ก่ด้สหา', 120, 100, 69.4444, 'Obesity', '2024-06-17 13:46:25'),
(22, 'thee', 200, 100, 25, 'Overweight', '2024-07-06 09:04:31'),
(23, 'thee', 200, 100, 25, 'Overweight', '2024-07-06 09:07:28'),
(24, 'thee', 200, 100, 25, 'Overweight', '2024-07-06 09:08:01'),
(25, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-09 14:35:00'),
(26, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-09 14:36:36'),
(27, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-09 14:37:08'),
(28, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-09 14:37:24'),
(29, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-09 14:38:17'),
(30, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-09 14:39:07'),
(31, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-09 14:39:33'),
(32, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-09 14:39:46'),
(33, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-09 14:40:04'),
(34, 'นายธนภัทร  เพชรรัตน์', 175, 65, 21.2245, 'น้ำหนักปกติ', '2024-07-13 03:19:27'),
(35, 'นายกรร มีความสุข', 175, 10, 3.26531, 'ผอมเกินไป', '2024-07-13 04:13:19'),
(36, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:43:18'),
(37, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:46:26'),
(38, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:48:51'),
(39, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:50:18'),
(40, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:50:42'),
(41, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:50:59'),
(42, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:51:19'),
(43, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:51:53'),
(44, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:52:01'),
(45, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:52:08'),
(46, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:52:17'),
(47, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:52:29'),
(48, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:53:00'),
(49, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:53:16'),
(50, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:53:25'),
(51, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:53:34'),
(52, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:53:40'),
(53, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:53:50'),
(54, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:54:05'),
(55, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:54:50'),
(56, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:54:57'),
(57, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:55:06'),
(58, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:55:34'),
(59, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:55:51'),
(60, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:56:42'),
(61, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:58:21'),
(62, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:59:14'),
(63, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:59:29'),
(64, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 10:59:52'),
(65, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 11:00:36'),
(66, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 11:00:45'),
(67, 'นายธนภัทร  เพชรรัตน์', 175, 60, 19.5918, 'น้ำหนักปกติ', '2024-07-17 11:02:37'),
(68, 'ลัทธพล สุจีรพันธ์', 169, 55, 19.257, 'น้ำหนักปกติ', '2024-07-18 15:40:20'),
(69, 'นายธนภัทร  เพชรรัตน์', 199, 40, 10.1008, 'ผอมเกินไป', '2024-07-18 15:41:04');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bmi_records`
--
ALTER TABLE `bmi_records`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bmi_records`
--
ALTER TABLE `bmi_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=70;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
